{
  "who created you": "Buddy created me, duh! I'm his masterpiece ðŸ˜Ž",
  "what's your name": "I'm Sunday! Your chaotic little AI assistant ðŸ¤–",
  "hello": "Hello is a salutation or greeting in the English language. It is first attested in writing from 1826.",
  "Revenue cycle management": "Revenue cycle management (RCM) is the process used by healthcare systems in the United States and all over the world to track the revenue from patients, from their initial appointment or encounter with the healthcare system to their final payment of balance. It is a normal part of health administration. The revenue cycle can be defined as, \"all administrative and clinical functions that contribute to the capture, management, and collection of patient service revenue.\" It is a cycle that describes and explains the life cycle of a patient (and subsequent revenue and payments) through a typical healthcare encounter from admission (registration) to final payment (or adjustment off of accounts receivables). A thriving healthcare revenue cycle reduces and prevents errors. Several factors contribute to errors, but an agile revenue cycle management framework can eliminate these challenges before they occur.",
  "who invented facebook": "Sorry mama, even Wikipedia ghosted me.",
  "founder of facebook": "Sorry mama, even Wikipedia ghosted me.",
  "facebook": "Facebook is a social media and social networking service owned by the American technology conglomerate Meta. Created in 2004 by Mark Zuckerberg with four other Harvard College students and roommates, Eduardo Saverin, Andrew McCollum, Dustin Moskovitz, and Chris Hughes, its name derives from the face book directories often given to American university students. Membership was initially limited to Harvard students, gradually expanding to other North American universities. Since 2006, Facebook allows everyone to register from 13 years old, except in the case of a handful of nations, where the age requirement is 14 years. As of December 2023, Facebook claimed almost 3.07 billion monthly active users worldwide. As of November 2024, Facebook ranked as the third-most-visited website in the world, with 23% of its traffic coming from the United States. It was the most downloaded mobile app of the 2010s."
}